/**
 * 目录
 * - 目标与期望是什么？
 * - 为了达到目标与期望做了以及发生了哪些事？
 * - 如何评估所做以及发生的事情？
 * - 总结
 *   - 回顾目标并和结果对比，和原定目标相比有哪些亮点和不足？
 *   - 有哪些可以提升的地方？
 *   - 如果再面临这类问题，如何决策？
 */






"目标与期望是什么？"
	整套信息收集的流程跑通，客户使用时候体验超越Word表单、
	// 超越Word表的信息收集





"为了达到目标与期望做了以及发生了哪些事？"
	6.有些东西经常会更新，每次通知过去非常麻烦，他们每次来问也很麻烦、
	5.github版本控制出大问题，修改的东西部分丢失！
	4.有些需求当意见有分歧时候咋搞？
	3.首页导航栏以及登录，需要抽出来，但是时间依然不允许这么做、
	2.着手改版信息收集，虽然很重要，但是时间不允许了、
	1.客服不愿意学习以及使用信息收集


"如何评估所做以及发生的事情？"
	6.所以其实文档挺重要的 => 企业云
	5.要有版本控制 => 给人一种进程感，这个东西是给别人看的
		- 要有备份的习惯
		- 要有需求池 => 效率 垃圾需求
		- 尽量不要用 github_for_windows 操作;（可视化还行）
	4.分歧点是什么？就是认为这样不好，到时候又要改、
		- 情况一，已经实现的情况下，视重要程度，放入需求池;
		- 情况二，未实现的情况下，那就赶紧达成共识实现了;
	3.需要github进行版本的控制
		- 以及详细记录修改了哪些内容、
	2.不做、就说要花费超多时间
		- 很简单，就是有时间再做
	1.娜姐那边的问题、



"总结"
	"回顾目标并和结果对比，和原定目标相比有哪些亮点和不足？"
	"有哪些可以提升的地方？"
	"如果再面临这类问题，如何决策？"






















