/**
 * 目录
 * - 目标与期望是什么？
 * - 为了达到目标与期望做了以及发生了哪些事？
 * - 如何评估所做以及发生的事情？
 * - 总结
 *   - 回顾目标并和结果对比，和原定目标相比有哪些亮点和不足？
 *   - 有哪些可以提升的地方？
 *   - 如果再面临这类问题，如何决策？
 */






"目标与期望是什么？"
	Steam上线一款自己时隔多年回来体验依然觉得很棒的游戏
		完成很艺术、很有代入感、很有中国特色、剧本
		学习游戏制作的技术



"为了达到目标与期望做了以及发生了哪些事？"
	2.想去培训原画，培训unity3D，找游戏公司积累、但是时间不允许！
	1.总觉得自己做不出游戏是因为缺钱



"如何评估所做以及发生的事情？"
	2.并不是必要条件(Steam上线一款自己时隔多年回来体验依然觉得很棒的游戏)，自己只是想去体验而已！
	1.没有钱处处会受制约，但不能简简单单把所有问题都丢给缺钱、


"总结"
	"回顾目标并和结果对比，和原定目标相比有哪些亮点和不足？"
	"有哪些可以提升的地方？"
	"如果再面临这类问题，如何决策？"

