/**
 * 目录
 * - 目标与期望是什么？
 * - 为了达到目标与期望做了以及发生了哪些事？
 * - 如何评估所做以及发生的事情？
 * - 总结
 *   - 回顾目标并和结果对比，和原定目标相比有哪些亮点和不足？
 *   - 有哪些可以提升的地方？
 *   - 如果再面临这类问题，如何决策？
 * - 正文
 *   - 游戏机制
 */



"目标与期望是什么？"
	完成很艺术、很有代入感、很有中国特色、剧本




"为了达到目标与期望做了以及发生了哪些事？"
	1.发现自己其实也不知道真正喜欢什么？所以不知道剧本应该怎么写、



"如何评估所做以及发生的事情？"




"总结"
	"回顾目标并和结果对比，和原定目标相比有哪些亮点和不足？"
	"有哪些可以提升的地方？"
	"如果再面临这类问题，如何决策？"






"正文"

	"游戏机制"
		一共4个技能QWER
		技能习得、效果、特色、与剧情息息相关(参考LOL)

	"角色"
		角色 {需求池} => 根据角色的性格特点 => 行动(重要-紧急);

		观众 {需求池} -> 根据主题(任务)(章节)需要 => 发展剧情;

	"女主"
		目标:为了、研究、
		- 世俗之人、
		- 文艺
		- 我们的女主
		- 家世曾经是荣耀，是为国家付出，并且眼光突出、
		- 类似于科研人员，文革，要求不能有欲望。
		- 愚昧的群众、允许自己腐败，不允许其他人腐败、
		例子 Saber
		▪ 谦卑
		▪ 荣誉
		▪ 牺牲
		▪ 英勇
		▪ 怜悯
		▪ 诚实
		▪ 精神
		▪ 公正
		重点 - 一种荣誉称号用于表示一个社会阶层、
		勇敢、忠诚的象征、
		骑士精神“骑士道”作为守则、“侠义之道”
		忠诚——信仰——荣耀——勇气
		居住在古色古香的城堡、
		贵族一般富足的生活、
		战胜邪恶的魔法师和巨人、
		保护善良但是无知的农民、
		贵妇人或者国王的名号行侠仗义、

	"男主"
		目标:反国外势力
		- 自由之人
		- 中二
		革命来着、
		双重身份，自动切换着来做人、

		应该说男主更加倾向贴近于自己、
		类似黑之契约者的黑、以及 F/Z 切丝、
		与“侠义之道”相反


	'事件' ->
		▪ 刻画人物性格
		▪ 描述世界观
		前期类似哆啦A梦一样的剧情走向
			支线任务、
			介绍完，以及熟悉场景必要条件后、
		后期类似狼人杀、
			表面上是想革命(占中)、
			实际最后是(自己人);
			类似于 台湾 香港问题 以及 印度 西藏、英国，各种博弈、

	'世界观 - 设定'
		▪ 一切以体验为服务、营造氛围、
		▪ 人物的塑造大于世界观的设定、
		深空失忆的后续（隐藏起来的）
			- 这些是最高势力的人才知道的（类似联合国）
			- 为什么隐藏起来？（类似于巨人）（ 巨人 = 异形 = 这个世界的设定 ）
		几大势力（隐藏起来的）
			1.本土生物（数量优势）（不经意间体现）
				- 仍然有许多未知（不经意间体现）
			2.人类势力（绝对优势）
				- 各大统治势力互相斗争（重点体现的部分）
				- 人类是藐视本土生物的（不经意间体现）


