/**
 * 目录
 * - 目标与期望是什么？
 * - 为了达到目标与期望做了以及发生了哪些事？
 * - 如何评估所做以及发生的事情？
 * - 总结
 *   - 回顾目标并和结果对比，和原定目标相比有哪些亮点和不足？
 *   - 有哪些可以提升的地方？
 *   - 如果再面临这类问题，如何决策？
 * - 正文
 *   - 游戏机制
 */



"目标与期望是什么？"
	完成很艺术、很有代入感、很有中国特色、故事
		达到《钢之炼金术师》那样，之后回忆起来觉得是个不错的回忆那就很棒了！



"为了达到目标与期望做了以及发生了哪些事？"
	1.发现自己其实也不知道真正喜欢什么？所以不知道剧本应该怎么写、


"如何评估所做以及发生的事情？"




"总结"
	"回顾目标并和结果对比，和原定目标相比有哪些亮点和不足？"
	"有哪些可以提升的地方？"
	"如果再面临这类问题，如何决策？"






"正文"

	"游戏机制"
		普攻:
			平A
			重攻击
		技能:
			一共4个技能QWER
			技能习得、效果、特色、与剧情息息相关(参考LOL)
			QWE均与主武器无关/R与主武器相关
		被动:
			一、瞬移
				右键 + 左键持续按下 = 蓄力 子弹时间 丢出主武器方向锁定 消耗魔法值 + 体力
				右键 + 左键再次按下 = 瞬移 + 惯性
				如果处理不当会损失一定的生命值
				主武器丢出之后，普通攻击与R无法使用/只能使用QWE技能、
			二、闪避
				空格是翻滚

	"角色"
		（角色目标）
		角色 {需求池} => 根据角色的性格特点 => 行动(重要-紧急);

		（原罪）
		观众 {需求池} -> 根据主题(任务)(章节)需要 => 发展剧情;

	"主题"
		党的十八大中 已经帮我们总结出来了，
		社会主义核心价值观！
			国家层面是富强，民主，文明，和谐。
			社会层面是自由，平等，公正，法制。
			公民层面是爱国，敬业，诚信，友善。

		为什么是倡导，就是因为这些问题在社会上是广为存在的！
		要突出这个主题，我们内容反着来写就对了！

		真诚的讽刺和悲剧，喜剧，照亮人性和社会的阴暗！这就是我们要做的！

		时代特别突出的例子:罗密欧与朱丽叶;

	"推动"
		艾希 - meta元素
		1.剧情推动 -> 角色的选择 + 玩家的选择 = 角色 不完全 玩家控制
		2.玩家 -> 角色思考 = meta元素
		3.角色 -> 玩家控制 = meta元素
		4.文字台词可以非常文艺

	"女主"
		表面目标:对技术喜爱，以及分享很爽;
		实际目标:守护内部变革来着、
		- 某项技术（双刃剑）的核心成员，国家重点培育对象、
		- 重点体现出专业和牛逼！能够非常机智的达到目标！（自身信念很美好，但是能一直抵抗坚守）
			- 非常善于合作(主要特征) -> 个人能力有限
		- 文艺（类似于 狂人的特色 不过没那么夸张而已）(次要特征)
		- 家世曾经是荣耀，是为国家付出，并且眼光突出、
			特点是:1.允许佩戴武器 2.家族拥有独立卫星
		例子Saber
			▪ 谦卑
			▪ 荣誉
			▪ 牺牲
			▪ 英勇
			▪ 怜悯
			▪ 诚实
			▪ 精神
			▪ 公正
		重点 - 一种荣誉称号用于表示一个社会阶层、
		勇敢、忠诚的象征、
			// 忠诚也是荣誉吧、类似于王的自傲、
		骑士精神“骑士道”作为守则、
			// “侠义之道”
		忠诚——信仰——荣耀——勇气
		居住在古色古香的城堡、
			// 特权的个区域（中关村，中央啥的）
		贵族一般富足的生活、
			// 平时比较闲
		战胜邪恶的魔法师和巨人、
		保护善良但是无知的农民、
		贵妇人或者国王的名号行侠仗义、
			// 秉持国家重点培育对象特权

	"男主"
		表面目标:反国外势力、
		实际目标:依靠革命变革来着、
		- 自由之人（自身信念很美好，但是剧情偏偏是要让美好的东西捏碎给别人看）
			- 非常独立(主要特征) -> 个人能力突出
		- 特别的组织，特别的标志、（类似于刺客）
		双重身份，自动切换着来做人、

		应该说男主更加倾向贴近于自己、
		类似黑之契约者的黑、以及 F/Z 切丝、
		与“侠义之道”相反


	'事件' ->
		1.会有很有特色的初次接触，		//（许多小故事刻画人物）
			随便死几个人，都是很严重的事件、至少会全国通报，广泛传播！
			男主会试探女主（是否革命）
		2.女主讲座和技术支援偶尔会有男主交集、      //（许多小故事刻画人物）
			女主也会试探（是否守护）
		3.初次革命事件			// 男女主就在一起了
			映射出矛盾点
		4.再次革命事件			// 男女主互相配合比较完美解决
			表面上是想革命(占中)、
			实际上是 捣乱势力(狼人杀)
				引狼;
				倒沟狼;
				深水浪;

			平民角色
			暴民角色
			守护方势力显现(女主)
				// 要隐藏自己
			革命方势力显现(男主)
				// 要隐藏自己

			类似于 台湾 香港问题 以及 印度 西藏、英国，各种博弈、
		/* 基本可完结 */
		5.核心武器溅射事件
			女主
		6.成功革命事件
			男主
		// ▪ 刻画人物性格、
		// ▪ 描述世界观、
		不写美好的剧本，写精彩但是内涵很美好的剧本，

	'世界观 - 设定'
		▪ 一切以体验为服务、营造氛围、
		▪ 人物的塑造大于世界观的设定、
		深空失忆的后续（隐藏起来的）
			- 这些是最高势力的人才知道的（类似联合国）
			- 为什么隐藏起来？（类似于巨人）（ 巨人 = 异形 = 这个世界的设定 ）
		几大势力（隐藏起来的）
			1.本土生物（数量优势）（不经意间体现）
				- 仍然有许多未知（不经意间体现）
			2.人类势力（绝对优势）
				- 各大统治势力互相斗争（重点体现的部分）
				- 人类是藐视本土生物的（不经意间体现）









